WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_qspi_flash_tests.c
/****************************************************************************
 * configs\stm32f777zit6-meadow\src\hcom_nx\tests\hcom_nx_qspi_flash_tests.c
 * 
 *   Copyright (C) 2019 - 2023 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// Available tests based on provided user data
// QspiWrite -1:  Bulk erases and writes data pattern to entire flash and reads to verify
// QspiWrite -2:  Bulk erases and writes data pattern to entire flash and stops
// QspiWrite -3:  Bulk erases and writes data pattern to one page and then verifies that all
//                 pages are correct, before and after the page written, repeats for each page.
//                 Note: This test will take about 26.4 years to complete for 512 MBit flash.
// QspiWrite -4:  Bulk erases and writes, flashes and reads to verify 0x55 repeats with 0xaa.
//                 Note: does everything twice to check each flash cell, take about 10 minutes.
// QspiWrite 0-n: Fill buffer with test pattern. Page data determined by developerValue 0-n
//
// QspiInit -1:   Bulk entire flash
// QspiInit -2:   Finds any non-erased sectors and erases them (faster than bulk erase)
// QspiInit 0-n:  Erases one 4k sector as determined by developerValue 0-n
//
// QspiRead -1:   Displays via syslog the data in any non-erased pages
// QspiRead -2:   Displays via syslog the data in erased pages (not very useful)
// QspiRead 0-n:  Displays the data in the page determined by developerValue 0-n

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "../hcom_nx_common.h"
#include <meadow/hcom_upd_shared.h>

#include <nuttx/arch.h>
#include <nuttx/mtd/mtd.h>
#include <crc8.h>

#include "stm32_qspi.h"
#include <nuttx/spi/qspi.h>
#include <dirent.h>

#if HCOM_INCLUDE_QSPI_FLASH_TESTS_IN_BUILD > 0

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

// Tried to align terminology with Nuttx. Page(256), Sector (4K)
// and Block (64k)

// How often to output syslog information?
#define FLASH_TEST_DISPLAY_INTERVAL (16 * 1024)

/****************************************************************************
 * Private Data
 ****************************************************************************/

static char *thisFile = __FILE__;

static FAR struct mtd_dev_s *_test_mtd = NULL;
static FAR struct mtd_geometry_s _test_geo;
static uint32_t _flash_test_write_page_size;
static uint32_t _flash_test_total_mtd_bytes;
static uint32_t _flash_test_total_write_pages;
static uint32_t _flash_test_pages_per_4k_sector;
static bool _mtdGeoShown;

//static   void * memTest;
/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int hcom_exec_flash_fs_flash_test_erase_1_4k_sector(uint32_t sectorOffset);
static int hcom_exec_flash_test_find_display_used_pages(bool eraseUsedPages, bool displayErasedPages);

/****************************************************************************
 * Public Functions
 ****************************************************************************/
int hcom_nx_exec_test_qspi_flash_setup(FAR struct mtd_dev_s *mtd)
{
  _test_mtd = mtd;
  return OK;
}

//===================================================================
// Returns the current time as a 64-bit number representing nanosec.
// Used for testing. Note: Only millisecond resolution due to
// Nuttx's clock resolution.
static uint64_t hcom_nx_utils_get_current_time64(void)
{
  struct timespec ts;
#ifdef CONFIG_CLOCK_MONOTONIC
  clock_gettime(CLOCK_MONOTONIC, &ts);
#else
  clock_gettime(CLOCK_REALTIME, &ts);
#endif
  return (uint64_t)ts.tv_sec * NSEC_PER_SEC + (uint64_t)ts.tv_nsec;
}

//===================================================================
static void hcom_exec_flash_convert_ms_to_time(uint32_t elapsedTimeMs, char* timeStr, int bufLen)
{
  uint32_t hours = 0;
  if(elapsedTimeMs >= 3600000)
  {
    hours = elapsedTimeMs/3600000;
    elapsedTimeMs = elapsedTimeMs - (3600000 * hours);
  }

  uint32_t minutes = elapsedTimeMs/60000;
  elapsedTimeMs = elapsedTimeMs - (60000 * minutes);
  uint32_t seconds = elapsedTimeMs/1000;
  elapsedTimeMs = elapsedTimeMs - (1000 * seconds);

  if(hours > 0)
    snprintf_chk(timeStr, bufLen, "%02lu:%02lu:%02lu.%03lu", hours, minutes, seconds, elapsedTimeMs);
  else
    snprintf_chk(timeStr, bufLen, "%02lu:%02lu.%03lu", minutes, seconds, elapsedTimeMs);
}

//=====================================================================
// Use this if the actual mtd is not known
static int hcom_exec_flash_initialize_mtd_for_testing(void)
{
  int ret;
  
  if(_test_mtd == NULL)
  {
    syslog(2, "%s@%d-ERRORThe MTD offset is NULL\n", thisFile, __LINE__);
    usleep(50 * 1000);
    return -1;
  }

