WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_qspi_flash_tests.c
  ret = _test_mtd->ioctl(_test_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&_test_geo));
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  _flash_test_write_page_size = _test_geo.blocksize;
  _flash_test_total_mtd_bytes = _test_geo.neraseblocks * _test_geo.erasesize;
  _flash_test_total_write_pages = _flash_test_total_mtd_bytes / _test_geo.blocksize;
  _flash_test_pages_per_4k_sector = _test_geo.erasesize / _test_geo.blocksize;

  if(!_mtdGeoShown)
  {
    syslog(2, "MTD Geo-Numb Erase Sectors:%lu, Erase Size:%u Page Size:%lu, Total Pages:%lu, Pages/Sector %lu\n",
            _test_geo.neraseblocks, _test_geo.erasesize, _test_geo.blocksize,
              _flash_test_total_write_pages, _flash_test_pages_per_4k_sector);
    _mtdGeoShown = true;
  }
  return OK;
}

//=====================================================================
// Populate the buffer with a complex pattern
static void hcom_exec_flash_populate_buffer(uint32_t pageNumber, uint8_t *pageBuffer)
{
  off_t off;
  uint8_t 
  tempBuffer[3];

  // Pattern - Each 256 byte page will be divided into 64, 32-bit words. Each 32-bit
  // word will contain the page number 0 - 131072 (0x20000) (bits 0-17), the page offset
  // (bits 18-23) and the crc8 checksum of bytes 0-2 (bits 24-31)

  tempBuffer[0] = pageNumber & 0x000000ff;
  tempBuffer[1] = (pageNumber & 0x0000ff00) >> 8;
  tempBuffer[2] = (pageNumber & 0x00030000) >> 16;

  // syslog(2, "pageNumber = %d buff[0] 0x%02x, buff[1] 0x%02x, buff[2] 0x%02x\n",
  //     pageNumber, tempBuffer[0], tempBuffer[1], tempBuffer[2]);

  for(off = 0; off < _flash_test_write_page_size; off += 4)
  {
    pageBuffer[off]     = tempBuffer[0];
    pageBuffer[off + 1] = tempBuffer[1];
    pageBuffer[off + 2] = tempBuffer[2];
    pageBuffer[off + 2] |= off;  // use offset / 4 (0 - 64)
    pageBuffer[off + 3] = crc8(pageBuffer + off, 3);

    // syslog(2, "  offset = %04d (0x%02x) buff[2] 0x%02x, buff[3] 0x%02x\n", off, ((off >> 2) & 0x3f) << 2,
    //   pageBuffer[off+2], pageBuffer[off+3]);
  }
}


//=====================================================================
// Takes a populated page buffer and verifies that its contents match
// what should be in it.
static bool hcom_exec_flash_verify_buffered_data(uint32_t pageNumber, uint8_t *pageBuffer)
{
  uint8_t testBuffer[_flash_test_write_page_size];

  hcom_exec_flash_populate_buffer(pageNumber, testBuffer);

  // syslog(2, "\n--------- data read ----------\n");
  // hcom_nx_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 1);
  // syslog(2, "\n--------- data calculated ----------\n");
  // hcom_nx_diag_print_buffer(testBuffer, _flash_test_write_page_size, 1);

  if(memcmp(pageBuffer, testBuffer, _flash_test_write_page_size) == 0)
    return true;

  return false;
}

//=====================================================================
// Populate the buffer with the user provided information
static void hcom_exec_flash_populate_buffer_user_pat(uint8_t userPattern, uint8_t *pageBuffer)
{
  off_t off;
  for(off = 0; off < _flash_test_write_page_size; off++)
  {
    pageBuffer[off] = userPattern;
  }
}

//=====================================================================
// 
static bool hcom_exec_flash_verify_buffered_data_2(uint8_t userPattern,
          uint32_t pageNumber, uint8_t *pageBuffer)
{
  uint8_t testBuffer[_flash_test_write_page_size];

  hcom_exec_flash_populate_buffer_user_pat(userPattern, testBuffer);

  // syslog(2, "\n--------- data read ----------\n");
  // hcom_nx_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 1);
  // syslog(2, "\n--------- data calculated ----------\n");
  // hcom_nx_diag_print_buffer(testBuffer, _flash_test_write_page_size, 1);

  if(memcmp(pageBuffer, testBuffer, _flash_test_write_page_size) == 0)
    return true;

  return false;
}

//===========================================================
static int hcom_exec_flash_fs_flash_test_erase_used_4k_sectors(void)
{
  return hcom_exec_flash_test_find_display_used_pages(true, false);
}

//===========================================================
static int hcom_exec_flash_test_find_display_erased_pages(void)
{
  return hcom_exec_flash_test_find_display_used_pages(false, true);
}

//===========================================================
// This function can display or erase the sectors used
static int hcom_exec_flash_test_find_display_used_pages(bool eraseUsedPages, bool displayErasedPages)
{
  off_t pageOff;
  int nread;
  int ret;
  int numbUsed = 0;
  bool patternFailed;
  bool eraseFailed;

  uint8_t pageBuffer[_flash_test_write_page_size];
  uint8_t eraseBuffer[_flash_test_write_page_size];
  memset(eraseBuffer, 0xff, _flash_test_write_page_size);

  if(eraseUsedPages && displayErasedPages)
  {
    syslog(2, "Unsupported request\n");
    usleep(50 * 1000);
    return -1;
  }

  else if(eraseUsedPages)
    syslog(2, "Checking %d pages to erase those used\n", _flash_test_total_write_pages);
  else if(displayErasedPages)
    syslog(2, "Checking %d pages to display those erased\n", _flash_test_total_write_pages);
  else
    syslog(2, "Checking %d pages to display those not erased\n", _flash_test_total_write_pages);

  // Now read and test that the entire qspi flash is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    patternFailed = false;
    eraseFailed = false;

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    if(nread != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
      usleep(50 * 1000);
      return nread;
    }

    // We are only interested in pages that do not have the
    // normal test pattern and are not erased.
    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
      patternFailed = true;

    if(memcmp(eraseBuffer, pageBuffer, _flash_test_write_page_size) != 0)
      eraseFailed = true;

    // Erase sector if it's not erased
    if(eraseUsedPages && (eraseFailed || patternFailed))
    {
      // Note this erases multiple pages
      uint32_t sectorOff = pageOff / _flash_test_pages_per_4k_sector;
      syslog(2, "Page offset %u (0x%08x) used. Erasing associated 4k sector %u (0x%08x)\n",
          pageOff, pageOff, sectorOff, sectorOff);
      ret = hcom_exec_flash_fs_flash_test_erase_1_4k_sector(sectorOff);
      if(ret < 0)
      {
        syslog(2, "Unsupported request\n");
        usleep(50 * 1000);
        return ret;
      }
      
      numbUsed++;
    }
    else if(displayErasedPages && patternFailed && !eraseFailed)
    {
      // Assumes pattern written to entire flash device except where erased.
      // Used to verify erase functionality.
      // Display erased page
      uint32_t sectorOff = pageOff / _flash_test_pages_per_4k_sector;
      syslog(2, "Page offset %u (0x%08x) erased. Associated 4k erase sector %u (0x%08x)\n",
          pageOff, pageOff, sectorOff, sectorOff);
      numbUsed++;
    }
    else if(patternFailed && eraseFailed)
    {
      // Just display if not pattern nor erased
      syslog(2, "\n--------- data read from page# %d----------\n", pageOff);
      hcom_nx_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 1);
      numbUsed++;
    }
  }

  if(eraseUsedPages)
    syslog(2, "Erased %d used pages\n", numbUsed);
  else if(displayErasedPages)
    syslog(2, "Found %d erased pages\n", numbUsed);
  else
    syslog(2, "Found %d pages not erased\n", numbUsed);
  
  return OK;
}

//=====================================================================
// Returns 0 for 100% success, 1-n = number failed, -value = error code
static int hcom_exec_flash_test_qspi_data_rw(bool verifyPages)
{
  uint8_t pageBuffer[_flash_test_write_page_size];
  off_t pageOff;
  int nread;
  int nfailed = 0;
  
  syslog(2, "QSPI Flash data testing %d pages has begun.\n", _flash_test_total_write_pages);
  uint64_t testTimeEraStart = hcom_nx_utils_get_current_time64();

#if 1 // Disable to allow retesting after power cycle etc.
  int nwrite;
  syslog(2, "MTD initialized to %p. Bulk erasing QSPI flash (2-3 minutes)\n", _test_mtd);
  int ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    return ret;
  }

  uint64_t testTimeEraEnd = hcom_nx_utils_get_current_time64();
  syslog(2, "Bulk erase of %lu completed.\n", _flash_test_total_write_pages);
  if(verifyPages)
    syslog(2, "Write all %lu pages then verify them.\n", _flash_test_total_write_pages);
  else
    syslog(2, "Write all %lu pages then exit.\n", _flash_test_total_write_pages);

