WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_qspi_flash_tests.c
  usleep(10);

  // Verify 100% erased
  syslog(2, "Verifying %lu pages erased.\n", _flash_test_total_write_pages);
  ret = hcom_exec_flash_test_find_display_used_pages(false, false);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s(). Verifying erased pages - ret:%d\n",
              thisFile, __LINE__, __func__, ret);
    return ret;
  }
  usleep(10);
  uint64_t testTimeVerEnd = hcom_nx_utils_get_current_time64();

  // Fill the entire QSPI flash with data
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    hcom_exec_flash_populate_buffer(pageOff, pageBuffer);

    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Writing to page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    if(nwrite != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nwrite:%d\n", thisFile, __LINE__, __func__, nwrite);
      return ret;
    }
  }
#endif

  if(!verifyPages)
  {
    syslog(2, "Pattern written to %d pages\n", _flash_test_total_write_pages);
    return OK;
  }
  
  syslog(2, "Data written. Verifying %d pages\n", _flash_test_total_write_pages);
  
  // Now read and test that the entire qspi flash is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Verifying page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    if(nread != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
      return ret;
    }

    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
    {
      if(nfailed == 0)
      {
        syslog(2, "Page %d was first to fail to compare\n", pageOff);
      }
      else
      {
        syslog(2, "Page %d also failed to compare\n", pageOff);
      }
      nfailed++;
    }
  }
  uint64_t testTimeTestEnd = hcom_nx_utils_get_current_time64();

  syslog(2, "Write / read test completed with %d errors\n", nfailed);
  
  char timeBufEra[16];
  char timeVerTest[16];
  char timeBufTest[16];
  char timeTotTest[16];

  hcom_exec_flash_convert_ms_to_time((testTimeEraEnd - testTimeEraStart)/1000000, timeBufEra, 16);
  hcom_exec_flash_convert_ms_to_time((testTimeVerEnd - testTimeEraEnd)/1000000, timeVerTest, 16);
  hcom_exec_flash_convert_ms_to_time((testTimeTestEnd - testTimeVerEnd)/1000000, timeBufTest, 16);
  hcom_exec_flash_convert_ms_to_time((testTimeTestEnd - testTimeEraStart)/1000000, timeTotTest, 16);
  syslog(2, "Bulk erase took:%s, verify erase: %s and fill & verify took:%s total:%s\n",
            timeBufEra, timeVerTest, timeBufTest, timeTotTest);

  return nfailed == 0 ? OK : nfailed;
}

//=====================================================================
// Returns 0 for 100% success, 1-n = number failed, -value = error code
// Erases, writes 0x55 to every location & verifies. Erases, writes 0xaa
// to every location & verifies.
static int hcom_exec_flash_test_qspi_data_rw_2(void)
{
  uint8_t pageBuffer[_flash_test_write_page_size];
  off_t pageOff;
  int nread;
  int nfailed = 0;

  syslog(2, "QSPI Flash data testing %d pages has begun.\n", _flash_test_total_write_pages);
  uint64_t testTimeTestStart = hcom_nx_utils_get_current_time64();

  int nwrite;
  syslog(2, "MTD initialized to %p. Bulk erasing QSPI flash (2-3 minutes)\n", _test_mtd);
  int ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    return ret;
  }

  syslog(2, "Bulk erase #1 of %lu completed.\n", _flash_test_total_write_pages);
  syslog(2, "Write all %lu pages then verify them.\n", _flash_test_total_write_pages);
  usleep(10);

  // Verify 100% erased
  syslog(2, "Verifying %lu pages erased.\n", _flash_test_total_write_pages);
  ret = hcom_exec_flash_test_find_display_used_pages(false, false);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s(). Verifying erased pages - ret:%d\n",
              thisFile, __LINE__, __func__, ret);
    return ret;
  }
  usleep(10);

  // Fill the entire QSPI flash with data
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    hcom_exec_flash_populate_buffer_user_pat(0x55, pageBuffer);

    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Writing to page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    if(nwrite != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nwrite:%d\n", thisFile, __LINE__, __func__, nwrite);
      return ret;
    }
  }

  syslog(2, "Data written. Verifying %d pages\n", _flash_test_total_write_pages);
  
  // Now read and test that the entire qspi flash is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Verifying page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    if(nread != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
      return ret;
    }

    if(!hcom_exec_flash_verify_buffered_data_2(0x55, pageOff, pageBuffer))
    {
      if(nfailed == 0)
      {
        syslog(2, "Page %d was first to fail to compare\n", pageOff);
      }
      else
      {
        syslog(2, "Page %d also failed to compare\n", pageOff);
      }
      nfailed++;
    }
  }

  // Now repeat the process using a different pattern

  syslog(2, "MTD initialized to %p. Bulk erasing QSPI flash again (2-3 minutes)\n", _test_mtd);
  ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    return ret;
  }

